app/controllers/iletisims_controller.rb

  def index
    @iletisims = Iletisim.all
---
SELECT `iletisims`.* FROM `iletisims`

  def create
    @iletisim = Iletisim.new(iletisim_params)
    if(user_signed_in? &&current_user.email?)
      @iletisim.sender=current_user.email
    end
    @iletisim.save
---
INSERT INTO `iletisims` (`content`, `created_at`, `sender`, `title`, `updated_at`) VALUES ('eğitim bolumu bekleniyor', '2015-02-22 17:23:02', 'teacher@gmail.com', 'ilk mesaj', '2015-02-22 17:23:02')

  def destroy
    @iletisim.destroy
---
DELETE FROM `iletisims` WHERE `iletisims`.`id` = 1

    def set_iletisim
      @iletisim = Iletisim.find(params[:id])
---
SELECT  `iletisims`.* FROM `iletisims`  WHERE `iletisims`.`id` = 1 LIMIT 1