app/controllers/imagetaleps_controller.rb

SELECT `imagetaleps`.* FROM `imagetaleps`  WHERE (gonderen_mail= 'instution@gmail.com')
---
  def index
    @imagetaleps = Imagetalep.where(["gonderen_mail= ?",current_user.email]).all

INSERT INTO `imagetaleps` (`created_at`, `gonderen_mail`, `gonderen_name`, `gonderen_tc`, `hastacinsiyet`, `hastaname`, `hastatc`, `hastayasi`, `image_content_type`, `image_file_name`, `image_file_size`, `image_tur`, `image_updated_at`, `unvan`, `updated_at`) VALUES ('2015-02-23 10:06:29', 'instution@gmail.com', 'esra', '22222222222', 'E', 'poyraz', '3333333333333', 34, 'image/jpeg', 'Caudal_regresyon_sendromu_koroner_MR.jpg', 1378099, 'BT', '2015-02-23 10:06:28', 'Yrd.Doç', '2015-02-23 10:06:29')
---
  def create
    @imagetalep = Imagetalep.new(imagetalep_params)
    if(user_signed_in?)
      @imagetalep.gonderen_tc=current_user.tc
      @imagetalep.gonderen_name=current_user.nameSurname
      @imagetalep.gonderen_mail=current_user.email
    end
    @imagetalep.durum="Talep"
    if @imagetalep.save

UPDATE `imagetaleps` SET `hastacinsiyet` = 'E', `image_file_name` = 'Caudal_regresyon_sendromu_sag_MR.jpg', `image_file_size` = 901575, `image_tur` = 'MR', `image_updated_at` = '2015-02-23 10:04:43', `unvan` = 'Prof.', `updated_at` = '2015-02-23 10:04:44' WHERE `imagetaleps`.`id` = 2
---
  def update
    @imagetalep.update(imagetalep_params)

SELECT  `imagetaleps`.* FROM `imagetaleps`  WHERE `imagetaleps`.`id` = 1 LIMIT 1
---
    def set_imagetalep
      @imagetalep = Imagetalep.find(params[:id])